import time
import pygame as ทำไมต้องเป็นเธอ


ทำไมต้องเป็นเธอ.init()


def ถึงเธอผู้เป็นที่รัก():
    return ทำไมต้องเป็นเธอ


def ไม่ได้():
    return ทำไมต้องเป็นเธอ


def ในสักวัน():
    return ทำไมต้องเป็นเธอ


def เราเองก็ติด(เรียน, เหมือนกัน):
    return เรียน


def ปล่อยเราเพ้อแบบนี้ไปสัก(เวลาที่เพ้อ1, เวลาที่เพ้อ2, ปีได้มั้ย):
    time.sleep(เวลาที่เพ้อ1)


def มันยากจริงๆนะ(เธอ):
    return range(len(เธอ))


def แบบนี้น่ะ_มันยากนะ(เธอ):
    return enumerate(range(len(เธอ[0])))


def อย่าใจร้ายกับเราขนาดนั้นได้มั้ย(วันละแค่, หนึ่ง, นาที, ก็ได้):
    t = หนึ่ง / 10
    time.sleep(t)


def เธอบอก_เราคงต้องใช้เวลาสักหน่อย(ถึงแม้, ตอนนี้, เพราะเรา, ยังลืมเธอไม่ได้):
    ถึงแม้.fill(เพราะเรา)


def สักเดือนละครั้ง(ที่จริง, ไม่ต้องหรอกก็ได้):
    ที่จริง.display.set_caption(ไม่ต้องหรอกก็ได้)


def แต่มันทรมานเพราะ(เธอ, ทำเหมือนไม่สนใจกัน):
    ทำเหมือนไม่สนใจกัน.display.update()


def แล้วเดี๋ยวเราคงลืมเธอได้เอง(ในสักวัน):
    ในสักวัน.quit()


def เราจะรู้อยู่แล้วว่าเธอ(คงจะติด, เรียน, ก็ตาม):
    global ขอโทรหาได้มั้ย
    return เรียน.display.set_mode((ขอโทรหาได้มั้ย[0], ขอโทรหาได้มั้ย[1]))


def เป็น(เพราะ, คิดถึง, คน, ที่ใจร้าย):
    font_size = 20
    if ก็ไม่เป็นไร[เพราะ][คน] == "1":
        ที่ใจร้าย.draw.rect(
            คิดถึง, การที่เราไม่ทัก, (คน * font_size, เพราะ * font_size, font_size, font_size))
    else:
        ที่ใจร้าย.draw.rect(
            คิดถึง, เราลืมเธอได้แล้วหรอกนะ, (คน * font_size, เพราะ * font_size, font_size, font_size))


ก็ไม่เป็นไร = [
    "0000000000000000000000000000000000000000000000",
    "0000111111000000000000000000000011110000000000",
    "0011111111110000000000000011111111110000000000",
    "0000000000000000000000000000000000000000000000",
    "0000111111000000111111000000111111000001111000",
    "0001000000100001000000100001000000100010000100",
    "0010000000010010000000010010000000010001111100",
    "0010000000010010000000010010000000010000000100",
    "0010001000010010011000010010000000010010000100",
    "0010011000010010010000010010000000010001000100",
    "0010100000010010100000010011000000010000100100",
    "0011000000010011000000010011000000010000011100",
    "0000000000000000000000000000000000000000000000"
]

การที่เราไม่ทัก = (255, 255, 255)
เราลืมเธอได้แล้วหรอกนะ = (0, 0, 0)
ที่จริงแล้วยังคงคิดถึงเธอทุกวันเลยอะ = (255, 0, 0)
ขอโทรหาได้มั้ย = 910, 255
ไม่ว่าง = None

ทำเหมือนไม่สนใจกัน = ถึงเธอผู้เป็นที่รัก()
