import จดหมาย as _
from จดหมาย import ถึงเธอผู้เป็นที่รัก

เรียน = ถึงเธอผู้เป็นที่รัก()

เรา, คิดถึงเธออะ = _.ขอโทรหาได้มั้ย
ถึงแม้ = _.เราจะรู้อยู่แล้วว่าเธอ("คงจะติด", เรียน, "อยู่ก็ตาม")
ที่จริง = _.เราเองก็ติด(เรียน, "เหมือนกัน")
_.สักเดือนละครั้ง(ที่จริง, "ไม่ต้องหรอกก็ได้..")

ถ้า, เธอ = _.ไม่ว่าง, _.ก็ไม่เป็นไร
แต่เธอรู้อะไรมั้ย = _.การที่เราไม่ทัก
มันไม่ได้แปลว่า = _.เราลืมเธอได้แล้วหรอกนะ
เพราะเรา = _.ที่จริงแล้วยังคงคิดถึงเธอทุกวันเลยอะ

def เธอจะไม่กลับมาจริงๆหรอ():
    for เพราะ in _.มันยากจริงๆนะ(เธอ):
        for การที่จะ, เลิกรักเธอ in _.แบบนี้น่ะ_มันยากนะ(เธอ):
            _.เป็น(เพราะ, ถึงแม้, เลิกรักเธอ, _.ไม่ได้())
            _.แต่มันทรมานเพราะ(เธอ, _.ทำเหมือนไม่สนใจกัน)
            _.อย่าใจร้ายกับเราขนาดนั้นได้มั้ย("วันละแค่", 1, "นาที", "ก็ได้")

_.เธอบอก_เราคงต้องใช้เวลาสักหน่อย(ถึงแม้, "ตอนนี้", เพราะเรา, "ยังลืมเธอไม่ได้")
_.แต่มันทรมานเพราะ(เธอ, _.ทำเหมือนไม่สนใจกัน)
เธอจะไม่กลับมาจริงๆหรอ()
_.ปล่อยเราเพ้อแบบนี้ไปสัก(2, 3, "ปีได้มั้ย")
_.แล้วเดี๋ยวเราคงลืมเธอได้เอง(_.ในสักวัน())