import time

class ความรักที่มีให้กัน():
    def __init__(self, ค่าความรัก):
        self.ค่าความรัก = int(ค่าความรัก * 100)

    def ความรักที่เธอมีให้ผม(self):
        self.ค่าความรัก -= 1
        print(f"ความรักที่เธอมีให้ผม {self.ค่าความรัก} / 100")

    def ความรักที่ผมมีให้เธอ(self):
        self.ค่าความรัก += 1
        print(f"ความรักที่ผมมีให้เธอ {self.ค่าความรัก} / 100")

    def หมดใจ(self):
        if self.ค่าความรัก <= 0:
            return True
        else:
            return False
        

def จังหวะเรารักกัน(เวลาที่คิดถึง):
    time.sleep(เวลาที่คิดถึง)


ช่วงเวลาที่เรามีกัน = True