from การเดินทางของความรัก import ความรักที่มีให้กัน
from การเดินทางของความรัก import จังหวะเรารักกัน
from การเดินทางของความรัก import ช่วงเวลาที่เรามีกัน

เธอ = ความรักที่มีให้กัน(100/100)
ผม = ความรักที่มีให้กัน(0/100)

def ความรักของเรา(เธอ, ผม):
    while ช่วงเวลาที่เรามีกัน:
        เธอ.ความรักที่เธอมีให้ผม()
        ผม.ความรักที่ผมมีให้เธอ()
        print("--------")
        จังหวะเรารักกัน(0.5)

        if เธอ.หมดใจ():
            return เธอ
        
เธอ = ความรักของเรา(เธอ, ผม)

print("\n--- เธอหมดรักคุณแล้ว ---\n")