import time
import pygame as ทำไมต้องเป็นเธอ

def ต้องส่งไปนานแค่ไหน(เวลาที่คิดถึง):
    time.sleep(เวลาที่คิดถึง)

def ระยะห่างของใจ(เธอ):
    return range(len(เธอ))

def ยังคง(คิดถึง, ทุกวัน):
    คิดถึง.fill(ทุกวัน)

def ยังรักเธอ(ที่ใจร้าย, เสมอ):
    ที่ใจร้าย.display.set_caption(เสมอ)

def มันทรมานเพราะ(เธอ, ที่ใจร้าย):
    ที่ใจร้าย.display.update()

def คงเป็นจุดจบของการที่รักคน(ที่ใจร้าย):
    ที่ใจร้าย.quit()

def แม้เป็นเธอ(ที่ใจร้าย, แต่ทำไมต้อง, ยังเพ้อถึงเธอเสมอ):
    return ที่ใจร้าย.display.set_mode((แต่ทำไมต้อง, ยังเพ้อถึงเธอเสมอ))

def เป็น(เพราะ, คิดถึง, คน, ที่ใจร้าย):
    font_size = 30
    if เธอ[เพราะ][คน] == "1":
        ที่ใจร้าย.draw.rect(
            คิดถึง, เพ้อ, (คน * font_size, เพราะ * font_size, font_size, font_size))
    else:
        ที่ใจร้าย.draw.rect(
            คิดถึง, ถึงเธอ, (คน * font_size, เพราะ * font_size, font_size, font_size))

เธอ = [
    "0000000000000000000000000000",
    "0010000011111111100111111100",
    "0010000010000000000000000100",
    "0010000011111110000000000100",
    "0010000000000010000000000100",
    "0010000001000010000110000100",
    "0011110001000010000100000100",
    "0010010001000010000100000100",
    "0011110001111110000111111100",
    "0000000000000000000000000000"
]

เพ้อ = (255, 255, 255)
ถึงเธอ = (0, 0, 0)
ทุกวัน = (255, 0, 0)
ความงี่เง่า = 840, 300