import ความคิดถึง
from ความคิดถึง import ทําไมต้องเป็นเธอ as ที่ใจร้าย
from ความคิดถึง import ความงี่เง่า as เพราะเรามันงี่เง่า

ที่ใจร้าย.init()

แต่ทำไมต้อง, ยังเพ้อถึงเธอเสมอ = เพราะเรามันงี่เง่า
คิดถึง = ความคิดถึง.แม้เป็นเธอ(ที่ใจร้าย, แต่ทำไมต้อง, ยังเพ้อถึงเธอเสมอ)
ความคิดถึง.ยังรักเธอ(ที่ใจร้าย, "เสมอ")

เธอ = ความคิดถึง.เธอ

เพ้อ = ความคิดถึง.เพ้อ
ถึงเธอ = ความคิดถึง.ถึงเธอ
ทุกวัน = ความคิดถึง.ทุกวัน

def ความคิดถึงทำให้ตายได้นะ():
    for เพราะ in ความคิดถึง.ระยะห่างของใจ(เธอ):
        for คน in ความคิดถึง.ระยะห่างของใจ(เธอ[0]):
            ความคิดถึง.เป็น(เพราะ, คิดถึง, คน, ที่ใจร้าย)
            ความคิดถึง.มันทรมานเพราะ(เธอ, ที่ใจร้าย)
            ความคิดถึง.ต้องส่งไปนานแค่ไหน(0.1)

ความคิดถึง.ยังคง(คิดถึง, ทุกวัน)
ความคิดถึง.มันทรมานเพราะ(เธอ, ที่ใจร้าย)
ความคิดถึงทำให้ตายได้นะ()
ความคิดถึง.ต้องส่งไปนานแค่ไหน(2)
ความคิดถึง.คงเป็นจุดจบของการที่รักคน(ที่ใจร้าย)